tutorials/cfdemSolverRhoPimple/VortexShedding/CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    out
    {
        type            fixedValue;
        value           uniform 101325;
    }
    sym1
    {
        type            symmetryPlane;
    }
    sym2
    {
        type            symmetryPlane;
    }
    in
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
