tutorials/cfdemSolverRhoPimple/VortexShedding/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.30;

deltaT          0.00002;

writeControl    adjustableRunTime;

writeInterval   0.0025;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           1;


functions
{
    probes
    {
        type        probes;
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );
        // Name of the directory for probe data
        name        probes;
        probeLocations
        (
            (0.0025 0 0)
            (0.0075 0 0)
            (0.0125 0 0)
            (0.0175 0 0)
            (0.0225 0 0)
            (0.0035 -0.00050 0)
            (0.0035  0.00050 0)
            (0.0075 -0.00075 0)
            (0.0075  0.00075 0)
            (0.0115 -0.00200 0)
            (0.0115  0.00200 0)
            (0.0165 -0.00200 0)
            (0.0165  0.00200 0)
            (0.0210 -0.00225 0)
            (0.0210  0.00225 0)
            (0.0250 -0.00275 0)
            (0.0250  0.00275 0)
        );

        // Fields to be probed
        fields (p U T rho);

        // Write at same frequency as fields
        writeControl   timeStep;
        writeInterval  50;
    }
}

// ************************************************************************* //
