tutorials/cfdemSolverRhoPimple/VortexShedding/CFD/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default 	     cellLimited leastSquares 1;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linearUpwindV default;
    div(phi,K)      Gauss linear;
    div(phi,h)      Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div((thermo:mu*dev(grad(U).T())))       Gauss linear;
    div((viscousTerm*dev2(grad(U).T())))    Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

// ************************************************************************* //
